test-1-6$ gcc -g p8original.c
~/test-1-6$ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x6c2: file p8original.c, line 16.
(gdb) r
Starting program: /home/runner/test-1-6/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p8original.c:16
16    float n=25;
(gdb) n
17    printf("Square root of %f is %f",n,square_Root(n));
(gdb) n
18    n=16;
(gdb) n
19    printf("\nSquare root of %f is %f",n,square_Root(n));
(gdb) n
Square root of 25.000000 is 5.000000
20    return 0;
(gdb) s
21  }(gdb) p
The history is empty.
(gdb) c
Continuing.
Square root of 16.000000 is 4.000000[Inferior 1 (process 108) exited with code 045]
(gdb) l
16    float n=25;
17    printf("Square root of %f is %f",n,square_Root(n));
18    n=16;
19    printf("\nSquare root of %f is %f",n,square_Root(n));
20    return 0;
21  }(gdb) q