 /test-1-6$ gcc -g p9original.c
p9original.c: In function ‘main’:
p9original.c:8:3: warning: implicit declaration of function ‘gets’; did you mean ‘fgets’? [-Wimplicit-function-declaration]
   gets(a);
   ^~~~
   fgets
/tmp/ccEG81OC.o: In function `main':
/home/runner/test-1-6/p9original.c:8: warning: the `gets' function is dangerous and should not be used.
~/test-1-6$ gdb a.out
\GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x795: file p9original.c, line 5.
(gdb) r
Starting program: /home/runner/test-1-6/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p9original.c:5
5   {
(gdb) n
7     printf("Enter the first string\n ");
(gdb) n
Enter the first string
8     gets(a);
(gdb) n
 n
10    printf("Enter the second string\n");
(gdb) n
Enter the second string
11    gets(b);
(gdb) n
 
13     if(strcmp(a,b)== 0)
(gdb) n
17         printf("Enter strings are not equal.\n");
(gdb) n
Enter strings are not equal.
19         return 0;
(gdb) n
22  }
(gdb) s
__libc_start_main (main=0x55de7ca0078a <main>, argc=1, 
    argv=0x7ffd49b5d1d8, init=<optimized out>, 
    fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffd49b5d1c8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 325) exited normally]
(gdb) l
339 in ../csu/libc-start.c
~/test-1-6$ 
